---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldContinuous
source: html/5cb403b7-e705-d6ef-fcd6-e690831948ca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldContinuous Property

"Continuous"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldContinuous { get; }
```